---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyIncompleteElement
source: html/4a1107f8-40c3-e567-6275-f2b7a63f7297.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotCopyIncompleteElement Property

Can't copy part of element

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCopyIncompleteElement { get; }
```